app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "adsasdasda"], ["email", "asdasdas@gdasd.com"], ["created_at", "2018-01-28 01:12:39.180895"], ["updated_at", "2018-01-28 01:12:39.180895"], ["password", "asdfghj"]]